<?php
/*
|--------------------------------------------------------------------------
| இணைய வழிகள் | Web & Api Routes
|--------------------------------------------------------------------------
|
| Controller , function மற்றும் Parameters  களை இங்கே முறைப்படி இடவும்.
| இது சரியாக இணைய வழிப்படுத்தலுக்கு உதவும்.
|
*/

/*__________________________________________
/*	______ __             ________        
/*	___  //_/_____ __________  __/____  __
/*	__  ,<  _  __ `/_  ___/_  /_ __  / / /
/*	_  /| | / /_/ /_(__  )_  __/ _  /_/ / 
/*	/_/ |_| \__,_/ /____/ /_/    _\__, /  
/*								/____/   🔰 𝟣.𝟢 */

return [

	new Route('HomeController', 'index', '|^/?$|'),

	new Route('HomeApiController', 'index', '|^api/?$|'), 

	new Route('HomeController', 'e404', '|^.*$|'),
];



